Embedfire-emwin/ebf_stm32f407_batianhu_emwin_demo/22.ucos_emwin创建天气应用/uCOSIII/os_cfg/includes.h
/*
*********************************************************************************************************
*                                              EXAMPLE CODE
*
*                             (c) Copyright 2013; Micrium, Inc.; Weston, FL
*
*               All rights reserved.  Protected by international copyright laws.
*               Knowledge of the source code may NOT be used to develop a similar product.
*               Please help us continue to provide the Embedded community with the finest
*               software available.  Your honesty is greatly appreciated.
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*
*                                           MASTER INCLUDES
*
*                                       IAR Development Kits
*                                              on the
*
*                                    STM32F429II-SK KICKSTART KIT
*
* Filename      : includes.h
* Version       : V1.00
* Programmer(s) : FT
*********************************************************************************************************
*/

#ifndef  INCLUDES_MODULES_PRESENT
#define  INCLUDES_MODULES_PRESENT


/*
*********************************************************************************************************
*                                         STANDARD LIBRARIES
*********************************************************************************************************
*/


#include  <stdio.h>
#include  <string.h>
#include  <ctype.h>
#include  <stdlib.h>
#include  <stdarg.h>
#include  <math.h>


/*
*********************************************************************************************************
*                                                 OS
*********************************************************************************************************
*/

#include  "os.h"


/*
*********************************************************************************************************
*                                              LIBRARIES
*********************************************************************************************************
*/

#include  <cpu.h>
#include  <lib_def.h>
#include  <lib_ascii.h>
#include  <lib_math.h>
#include  <lib_mem.h>
#include  <lib_str.h>

/*
*********************************************************************************************************
*                                                 ST
*********************************************************************************************************
*/

#include  "stm32f4xx.h"


/*
*********************************************************************************************************
*                                              APP / BSP
*********************************************************************************************************
*/
#include <os_app_hooks.h>
#include  <app_cfg.h>
#include  <bsp.h>

#include "./usart/bsp_debug_usart.h"
#include "./led/bsp_led.h" 
#include "./touch/gt5xx.h"
#include "./sram/bsp_sram.h"	  
#include "./key/bsp_key.h" 
#include "./beep/bsp_beep.h"
#include "./TouchPad/bsp_touchpad.h"
#include "./lcd/bsp_ili9806g_lcd.h"
#include "./DHT11/bsp_dht11.h"
#include "./DS18B20/bsp_ds18b20.h"
#include "./photoresister/bsp_photoresister.h"


#include "ff.h"

#include "GUIFont_Port.h"   
#include "GUIPicture_Port.h"   

#include "GUIDEMO.h"

#include "desktop.h"

/*
*********************************************************************************************************
*                                               emWin
*********************************************************************************************************
*/
#include "GUI.h"
#include "DIALOG.h"

/*
*********************************************************************************************************
*                                               PROBE
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                               SERIAL
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                            INCLUDES END
*********************************************************************************************************
*/


#endif
